{
    "common": {
        "name": "bring",
        "version": "1.6.0",
        "news": {
            "1.6.0": {
                "en": "widget is now translated, big frontend optimizations and bugfixes in front- and backend",
                "de": "Widget ist jetzt übersetzt, große Frontend-Optimierungen und Bugfixes im Front- und Backend",
                "ru": "Виджет теперь переведен, большие оптимизации веб-интерфейса и исправления ошибок в передней и задней частях.",
                "pt": "widget agora é traduzido, grandes otimizações frontend e correções de bugs na frente e backend",
                "nl": "widget is nu vertaald, grote front-end optimalisaties en bugfixes in front- en backend",
                "fr": "le widget est maintenant traduit, grandes optimisations frontales et corrections de bugs en avant et en arrière",
                "it": "il widget è ora tradotto, grandi ottimizzazioni frontend e bugfix in front e backend",
                "es": "El widget está ahora traducido, las grandes optimizaciones de la interfaz y las correcciones de errores en la parte frontal y posterior.",
                "pl": "Widget jest teraz przetłumaczony, duże optymalizacje frontendu i poprawki błędów w frontend i backend",
                "zh-cn": "widget现在被翻译，大前端优化和前端和后端的错误修正"
            },
            "1.4.0": {
                "en": "use textFit to fit longer text to widget + internal reworks for widget",
                "de": "Verwenden Sie textFit, um längeren Text in das Widget einzufügen, sowie interne Überarbeitungen für das Widget",
                "ru": "использовать textFit для подгонки длинного текста к виджету + внутренние изменения для виджета",
                "pt": "use textFit para ajustar texto mais longo ao widget + retrabalho interno para widget",
                "nl": "gebruik textFit om langere tekst aan widget + interne reworks voor widget aan te passen",
                "fr": "utilisez textFit pour adapter du texte plus long au widget + retouches internes pour le widget",
                "it": "usa textFit per adattare testo più lungo a widget + rielaborazioni interne per widget",
                "es": "use textFit para ajustar texto más largo al widget + trabajos internos para el widget",
                "pl": "użyj textFit, aby dopasować dłuższy tekst do widgetu + wewnętrzne przeróbki widgetu",
                "zh-cn": "使用textFit将较长的文本适合小部件+内部重新构建小部件"
            },
            "1.3.4": {
                "en": "add possibility to use this widget multiple times on same page",
                "de": "Möglichkeit hinzufügt, dieses Widget mehrmals auf derselben Seite zu verwenden",
                "ru": "добавить возможность использовать этот виджет несколько раз на одной странице",
                "pt": "Adicionar possibilidade de usar este widget várias vezes na mesma página",
                "nl": "voeg mogelijkheid toe om deze widget meerdere keren op dezelfde pagina te gebruiken",
                "fr": "ajout de la possibilité d'utiliser ce widget plusieurs fois sur la même page",
                "it": "aggiungere la possibilità di utilizzare questo widget più volte nella stessa pagina",
                "es": "Agregue la posibilidad de usar este widget varias veces en la misma página.",
                "pl": "dodaj możliwość wielokrotnego używania tego widżetu na tej samej stronie",
                "zh-cn": "添加在同一页面上多次使用此小部件的可能性"
            },
            "1.3.3": {
                "en": "also change height and div sizes according to users specification and when item is on recent list and added by text input it is now instantly removed from recent list",
                "de": "Ändern der Höhe un der div-Größe, entsprechend den Benutzerspezifikationen. Wenn sich das Element in der kürzlichen Liste befindet und durch Texteingabe hinzugefügt wird, wird es nun sofort aus der kürzlichen Liste entfernt",
                "ru": "также изменяйте высоту и размеры div в соответствии со спецификацией пользователя, и когда элемент находится в недавнем списке и добавляется с помощью ввода текста, он немедленно удаляется из недавнего списка",
                "pt": "também altere a altura e os tamanhos div de acordo com a especificação do usuário e quando o item estiver na lista recente e adicionado por entrada de texto, ele será instantaneamente removido da lista recente",
                "nl": "verander ook de hoogte en div-maten volgens de gebruikersspecificatie en wanneer het item in de recente lijst staat en door tekstinvoer is toegevoegd, wordt het nu direct uit de recente lijst verwijderd",
                "fr": "permet également de modifier la taille et la taille des divisions en fonction des spécifications de l'utilisateur. Lorsque l'élément est répertorié et ajouté par saisie de texte, il est instantanément supprimé de la liste récente.",
                "it": "cambia anche l'altezza e le dimensioni div in base alle specifiche degli utenti e quando l'elemento si trova nell'elenco recente e aggiunto dall'input di testo, viene immediatamente rimosso dall'elenco recente",
                "es": "también cambia la altura y los tamaños de div según la especificación de los usuarios y cuando el elemento está en la lista reciente y se agrega mediante entrada de texto, ahora se elimina instantáneamente de la lista reciente",
                "pl": "zmieniaj także wysokość i rozmiary dywanów zgodnie ze specyfikacją użytkownika, a gdy element jest na ostatniej liście i dodawany przez wprowadzanie tekstu, jest natychmiast usuwany z listy",
                "zh-cn": "还根据用户规格更改高度和div大小，当项目在最近列表中并通过文本输入添加时，它现在立即从最近的列表中删除"
            },
            "1.3.2": {
                "en": "enable configuration of width for items in widget",
                "de": "Möglichkeit der Konfiguration der Breite für Elemente im Widget",
                "ru": "включить настройку ширины для элементов в виджете",
                "pt": "ativar a configuração de largura para itens no widget",
                "nl": "schakel configuratie van breedte in voor items in widget",
                "fr": "activer la configuration de la largeur des éléments dans le widget",
                "it": "abilita la configurazione della larghezza per gli oggetti nel widget",
                "es": "Habilitar configuración de ancho para elementos en widget",
                "pl": "włącz konfigurację szerokości dla elementów w widgecie",
                "zh-cn": "为小部件中的项启用宽度配置"
            },
            "1.3.1": {
                "en": "outsourced api module",
                "de": "API-Modul ausgelagert",
                "ru": "внешний API-модуль",
                "pt": "módulo api terceirizado",
                "nl": "uitbestede api-module",
                "fr": "module d'api externalisé",
                "it": "modulo API esternalizzato",
                "es": "módulo api subcontratado",
                "pl": "outsourcing modułu api",
                "zh-cn": "外包api模块"
            },
            "1.3.0": {
                "en": "added widget",
                "de": "Widget hinzugefügt",
                "ru": "добавлен виджет",
                "pt": "widget adicionado",
                "nl": "toegevoegde widget",
                "fr": "widget ajouté",
                "it": "aggiunto widget",
                "es": "widget añadido",
                "pl": "dodano widżet",
                "zh-cn": "添加小部件"
            },
            "1.2.1": {
                "en": "uri encode login request because it can contain special character",
                "de": "Anmeldeanforderung für die URI-Codierung, da Sonderzeichen enthalten sein",
                "ru": "URI кодировать запрос на вход в систему, потому что он может содержать специальный символ",
                "pt": "uri codifica o pedido de login porque pode conter caracteres especiais",
                "nl": "uri codeert inlogaanvraag omdat het een speciaal teken kan bevatten",
                "fr": "uri encoder la demande de connexion car il peut contenir des caractères spéciaux",
                "it": "uri codifica la richiesta di accesso perché può contenere caratteri speciali",
                "es": "uri codificar solicitud de inicio de sesión, ya que puede contener caracteres especiales",
                "pl": "uri koduje żądanie logowania, ponieważ może zawierać znak specjalny",
                "zh-cn": "uri编码登录请求，因为它可以包含特殊字符"
            },
            "1.2.0": {
                "en": "added state which contains a speakable enumeration of each shopping list",
                "de": "hinzugefügter Zustand, der eine sprechbare Aufzählung jeder Einkaufsliste enthält",
                "ru": "добавленное состояние, которое содержит понятное перечисление каждого списка покупок",
                "pt": "estado adicionado que contém uma enumeração falável de cada lista de compras",
                "nl": "toegevoegde status die een sprekende opsomming van elke boodschappenlijst bevat",
                "fr": "état ajouté qui contient une énumération parlable de chaque liste de courses",
                "it": "stato aggiunto che contiene un'enumerazione leggibile di ogni lista della spesa",
                "es": "Estado agregado que contiene una enumeración hablable de cada lista de compras.",
                "pl": "dodano stan, który zawiera wyraźne wyliczenie każdej listy zakupów",
                "zh-cn": "添加状态，其中包含每个购物清单的可说明的枚举"
            },
            "1.1.0": {
                "en": "add possibility to send messages",
                "de": "Möglichkeit hinzufügen, Nachrichten zu senden",
                "ru": "добавить возможность отправлять сообщения",
                "pt": "adicionar possibilidade de enviar mensagens",
                "nl": "mogelijkheid toevoegen om berichten te verzenden",
                "fr": "ajouter la possibilité d'envoyer des messages",
                "it": "aggiungere la possibilità di inviare messaggi",
                "es": "Añadir posibilidad de enviar mensajes.",
                "pl": "dodaj możliwość wysyłania wiadomości",
                "zh-cn": "增加发送消息的可能性"
            },
            "1.0.0": {
                "en": "stable release",
                "de": "stabile Version",
                "ru": "стабильный выпуск",
                "pt": "versão estável",
                "nl": "stabiele vrijlating",
                "fr": "version stable",
                "it": "rilascio stabile",
                "es": "lanzamiento estable",
                "pl": "wersja stabilna",
                "zh-cn": "稳定释放"
            },
            "0.0.10": {
                "en": "set info.connection state to false, when cannot get data",
                "de": "Setze den Status von info.connection auf false, wenn keine Daten abgerufen werden können",
                "ru": "установить состояние info.connection в false, когда не удается получить данные",
                "pt": "defina state.connection state como false, quando não puder obter dados",
                "nl": "set info.connection state to false, when can not get data",
                "fr": "définir l'état info.connection sur false, lorsqu'il est impossible d'obtenir des données",
                "it": "imposta lo stato info.connection su false, quando non è possibile ottenere i dati",
                "es": "establezca el estado de info.connection en falso, cuando no pueda obtener datos",
                "pl": "ustaw stan info.connection na false, kiedy nie można uzyskać danych",
                "zh-cn": "将info.connection状态设置为false，何时无法获取数据"
            },
            "0.0.9": {
                "en": "also updating no head states on normal polling, important bugfixes and handle no internet connection error",
                "de": "Es werden auch NoHead Zustände beim normalen Polling aktualisiert, wichtige Bugfixes und keine Internetverbindungsfehler behandelt",
                "ru": "также обновляет состояние без заголовка при обычном опросе, важные исправления ошибок и не обрабатывает ошибку интернет-соединения",
                "pt": "também atualizando sem estados de cabeça no polling normal, correções de bugs importantes e não lida com erros de conexão com a Internet",
                "nl": "ook geen head states bij te werken op normale polling, belangrijke bugfixes en geen internetverbinding te verhelpen",
                "fr": "met également à jour aucun état principal lors de l'interrogation normale, corrige des bogues importants et ne gère aucune erreur de connexion Internet",
                "it": "inoltre non aggiorna gli stati della testa al polling normale, correzioni di bug importanti e non gestisce alcun errore di connessione internet",
                "es": "También no se actualizan los estados principales en el sondeo normal, se corrigen errores importantes y no se maneja ningún error de conexión a Internet",
                "pl": "nie aktualizuje również stanów głowic podczas normalnego odpytywania, ważnych poprawek i nie obsługuje błędu połączenia z Internetem",
                "zh-cn": "在正常轮询，重要错误修正和处理没有互联网连接错误也更新没有头状态"
            },
            "0.0.8": {
                "en": "added html states without header and minor fixes",
                "de": "HTML-Status ohne Header und kleinere Korrekturen hinzugefügt",
                "ru": "добавлены HTML-состояния без заголовка и незначительных исправлений",
                "pt": "adicionou estados html sem cabeçalho e pequenas correções",
                "nl": "html-staten toegevoegd zonder header en kleine fixes",
                "fr": "ajout d'états html sans en-tête ni correctifs mineurs",
                "it": "stati aggiunti html senza intestazione e correzioni minori",
                "es": "Estados HTML añadidos sin encabezado y correcciones menores",
                "pl": "dodano stany html bez nagłówka i drobnych poprawek",
                "zh-cn": "添加了没有标题和次要修复的html状态"
            }
        },
        "title": "Bring!",
        "desc": {
            "en": "Manage your shopping list with Bring!",
            "de": "Verwalten Sie Ihre Einkaufsliste mit Bring!",
            "ru": "Управляйте своим списком покупок с Bring!",
            "pt": "Gerencie sua lista de compras com o Bring!",
            "nl": "Beheer uw boodschappenlijstje met Bring!",
            "fr": "Gérez votre liste de courses avec Bring!",
            "it": "Gestisci la tua lista della spesa con Bring!",
            "es": "Gestiona tu lista de compras con Bring!",
            "pl": "Zarządzaj swoją listą zakupów za pomocą narzędzia Przynieś!",
            "zh-cn": "使用Bring管理您的购物清单！"
        },
        "authors": [
            "Moritz Heusinger <moritz.heusinger@gmail.com>"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "mode": "daemon",
        "icon": "bring.png",
        "materialize": true,
        "enabled": true,
        "compact": true,
        "messagebox": true,
        "extIcon": "https://raw.githubusercontent.com/foxriver76/ioBroker.bring/master/admin/bring.png",
        "keywords": [
            "bring!",
            "bring",
            "shopping list",
            "shopping",
            "list"
        ],
        "readme": "https://github.com/foxriver76/ioBroker.bring/blob/master/README.md",
        "loglevel": "info",
        "type": "household",
        "restartAdapters": [
            "vis"
        ]
    },
    "docs": {
        "de": "docs/de/README.md"
    },
    "native": {
        "mail": "",
        "password": "",
        "notificationsType": "E-Mail",
        "emailInstance": "",
        "telegramInstance": "",
        "pushoverInstance": "",
        "emailSender": "",
        "emailReceiver": "",
        "telegramReceiver": "",
        "pushoverDeviceID": ""
    },
    "protectedNative": [
        "mail",
        "password"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to Bring! API",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.user",
            "type": "state",
            "common": {
                "role": "name",
                "name": "Name of logged-in user",
                "type": "string",
                "read": true,
                "write": false
            },
            "native": {}
        }
    ]
}